[
    {
        "name": "Car Price Prediction Model",
        "language": ["Python"],
        "tools": ["scikit-learn", "pandas", "docker"],
        "description": "Developed a robust regression model to accurately predict car auction prices based on factors like brand, model, manufacturing year, and more, significantly enhancing price estimation processes."
    },
    {
        "name": "Advanced Steganography Pipeline",
        "language": ["Python"],
        "tools": ["OpenCV", "NumPy", "docker"],
        "description": "Engineered a sophisticated pipeline utilizing OpenCV for image and audio processing, implementing advanced steganography techniques to securely conceal user identification within multimedia content."
    },
    {
        "name": "Wav-to-Talking Head Animation",
        "language": ["Python"],
        "tools": ["TensorFlow", "Generative Adversarial Networks (GANs)", "docker"],
        "description": "Designed and implemented a cutting-edge neural network model to generate realistic talking head animations from audio input, leveraging GANs to enhance animation quality."
    },
    {
        "name": "Cardboard QR Code Classifier",
        "language": ["Python"],
        "tools": ["TensorFlow", "EfficientNet", "docker"],
        "description": "Built and trained an efficient deep learning model for accurate classification of QR code images on cardboard materials, improving scanning efficiency and reliability."
    },
    {
        "name": "Symptom Clustering NLP Model",
        "language": ["Python"],
        "tools": ["spaCy", "scikit-learn", "docker"],
        "description": "Developed an advanced NLP model to classify and cluster medical symptoms from textual data, facilitating more accurate and efficient medical diagnoses."
    },
    {
        "name": "Employee Performance Optimization Platform",
        "language": ["Python"],
        "tools": ["pandas", "NumPy", "matplotlib", "docker"],
        "description": "Developed comprehensive end-to-end solutions to optimize employee performance and feedback processes, significantly enhancing productivity and fostering professional growth."
    },
    {
        "name": "End-to-End Data Lakehouse Implementation",
        "language": ["Python", "SQL"],
        "tools": ["Apache Spark", "Apache Superset", "Apache Iceberg", "MinIO", "docker"],
        "description": "Led the successful implementation of a complete data lakehouse solution, utilizing cutting-edge technologies for efficient data storage, processing, and visualization, thereby streamlining data analytics workflows."
    },
    {
        "name": "Discord Bot for Fifatargrean Channel",
        "language": ["Python", "Flask"],
        "tools": ["Discord API", "docker"],
        "description": "Developed a Discord bot to handle 1k users in the Fifatargrean channel, automatically banning scammers and assigning contributor roles to active community members."
    },
    {
        "name": "Fifatargrean Media Share Platform",
        "language": ["Python", "Flask"],
        "tools": ["Discord API", "PostgreSQL", "docker"],
        "description": "Created a web platform where members can share videos, and streamers can host watch parties, using Python Flask and Discord API with PostgreSQL for backend management."
    },
    {
        "name": "LCKYN Website",
        "language": ["Next.js", "React", "TypeScript"],
        "tools": ["Next.js", "React", "TypeScript"],
        "description": "Developed a website for LCKYN to introduce users to its goals and outlook using modern web technologies like Next.js and React with TypeScript."
    },
    {
        "name": "Own ChatGPT Application",
        "language": ["Next.js", "React", "TypeScript"],
        "tools": ["OpenAI API", "Claude API"],
        "description": "Developed an affordable chatbot platform where users can select and switch between OpenAI and Claude models, providing a cheaper alternative to typical LLM subscriptions."
    }
]
